#### 1) Create a pandas data frame d1 with following data

In [79]:
import pandas as pd
data_dict = {'one':[0,4,8],'two':[1,5,9],'three':[2,6,10],'four':[3,7,11]}
data = pd.DataFrame(data_dict,index=['Ohio,Colarado,NewYork'.split(',')])
data

          one  two  three  four
Ohio        0    1      2     3
Colarado    4    5      6     7
NewYork     8    9     10    11

#### 2. Add two columns namely duplicate1, duplicate1 with data frame in question 1 and values to Columns using pandas series.

In [9]:
df2 = data
df2['duplicate']=data.one+data.two
df2

          one  two  three  four  duplicate
Ohio        0    1      2     3          1
Colarado    4    5      6     7          9
NewYork     8    9     10    11         17

#### 3. Drop New York row from the data frame obtained in the question 2 and store the result in DF3 And display.

In [11]:
df3 = df2.drop('NewYork',axis = 0)
df3

D:\Computer science\lib\site-packages\pandas\core\generic.py:4150: PerformanceWarning: dropping on a non-lexsorted multi-index without a level parameter may impact performance.
  obj = obj._drop_axis(labels, axis, level=level, errors=errors)

          one  two  three  four  duplicate
Ohio        0    1      2     3          1
Colarado    4    5      6     7          9

##### 4. Create a pandas series with values 0-9 and provide the indexes one, two, threeâ€¦..nine.

In [30]:
lst = ['one,two,three,four,five,six,seven,eight,nine,ten'.split(',')]
a = pd.Series(range(0,10),index=lst)
a

one      0
two      1
three    2
four     3
five     4
six      5
seven    6
eight    7
nine     8
ten      9
dtype: int64

##### 5. Perform division operation between data frame obtained in question 1 and pandas series Obtained in question 4 and store the result in another variable.

In [68]:
df5 = data

In [74]:

df5 = data
df5['a'] = [1,2,3]
for col in list(df5.columns):
    df5[col].astype(float)
    df5[col] = df5[col] / df5['a']
df5  =df5.drop('a',axis=1)
df5

               one   two     three      four
Ohio      0.000000  1.00  2.000000  3.000000
Colarado  1.000000  1.25  1.500000  1.750000
NewYork   0.888889  1.00  1.111111  1.222222

##### 6. Create NaN value with DataFrame question 1,check if a DataFrame d1 has may missing value, to replace NaNs with a single constant value in specified columns in a DataFrame.

In [29]:
import numpy as np
df6 = data
df6['one'] = pd.Series([0,np.nan,8])
df6['one'] = df6['one'].fillna(4)
df6

          one  two  three  four
Ohio      4.0    1      2     3
Colarado  4.0    5      6     7
NewYork   4.0    9     10    11

#### 7. Creating a series containing two arrays of indexes (i.e., creating a structure with two levels) and swap two level.

In [77]:
lst = ['one,two,three,four,five,six,seven,eight'.split(',')]
arrays = [[range(1,5)],[range(5,9)]]
s = pd.Series(lst, index=arrays)
print(s

(1, 2, 3, 4)  (5, 6, 7, 8)    [one, two, three, four, five, six, seven, eight]
dtype: object

#### 8. With data frame Question 1 convert into series.

In [91]:
a = data.apply(pd.Series).stack().reset_index(drop=True)
a

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
dtype: int64